
## Plan Result

[CI link](https://github.com/enokawa/terraform-sandbox/actions/runs/4761869238)


<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.vpc_secutiry_group.aws_ec2_managed_prefix_list.enokawa
  * module.vpc_secutiry_group.aws_security_group.ec2_bastion
  * module.vpc_secutiry_group.aws_security_group_rule.ec2_bastion_egress_allow_all
  * module.vpc_secutiry_group.aws_security_group_rule.ec2_bastion_ingress_allow_ssh


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.vpc_secutiry_group.aws_ec2_managed_prefix_list.enokawa will be created
  + resource "aws_ec2_managed_prefix_list" "enokawa" {
      + address_family = "IPv4"
      + arn            = (known after apply)
      + id             = (known after apply)
      + max_entries    = 2
      + name           = "dev-sandbox-enokawa-1"
      + owner_id       = (known after apply)
      + tags           = {
          + "Env" = "dev-sandbox-enokawa-1"
        }
      + tags_all       = {
          + "CreatedBy"   = "Terraform"
          + "Env"         = "dev-sandbox-enokawa-1"
          + "Environment" = "dev"
          + "ProjectName" = "sandbox"
        }
      + version        = (known after apply)

      + entry {
          + cidr        = "10.0.0.10/32"
          + description = "enokawa"
        }
      + entry {
          + cidr        = "10.0.16.10/32"
          + description = "naoto"
        }
    }

  # module.vpc_secutiry_group.aws_security_group.ec2_bastion will be created
  + resource "aws_security_group" "ec2_bastion" {
      + arn                    = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "dev-sandbox-ec2-bastion-1"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "dev-sandbox-ec2-bastion-1"
        }
      + tags_all               = {
          + "CreatedBy"   = "Terraform"
          + "Environment" = "dev"
          + "Name"        = "dev-sandbox-ec2-bastion-1"
          + "ProjectName" = "sandbox"
        }
      + vpc_id                 = "vpc-04aede4e87135b698"
    }

  # module.vpc_secutiry_group.aws_security_group_rule.ec2_bastion_egress_allow_all will be created
  + resource "aws_security_group_rule" "ec2_bastion_egress_allow_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.vpc_secutiry_group.aws_security_group_rule.ec2_bastion_ingress_allow_ssh will be created
  + resource "aws_security_group_rule" "ec2_bastion_ingress_allow_ssh" {
      + from_port                = 22
      + id                       = (known after apply)
      + prefix_list_ids          = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":8,"Program":"tfcmt","SHA1":"86bcc333c2a4d7d9641d4a301fb4c23970e0288e","Vars":{},"WorkflowName":"Terraform Plan (develop)"} -->